Repository: TodoshiTakato/cscart
Catalog: var/langs/*/addons/*_payment.po
Languages: ru_ru

# Addons::name::my_payment
source: my_payment
ru_ru: _Платежная система my_payment

# Addons::description::my_payment
source: Description for my_payment
ru_ru: Описание модуля my_payment

# Languages::text_my_payment_callback_url
source: text_my_payment_callback_url_ru
ru_ru: Важно! Необходимо указать URL-адрес <b>[prepare_url]</b> в качестве адреса проверки и <b>[complete_url]</b> в качестве адреса завершения в кабинете поставщика (https://merchant.click.uz).

# Languages::addons.my_payment.merchant_id
source: my_payment Merchant ID
ru_ru: ID Поставщика

# Languages::addons.my_payment.merchant_user_id
source: my_payment Merchant User ID
ru_ru: ID Пользователя Поставщика

# Languages::addons.my_payment.service_id
source: my_payment Merchant Service ID
ru_ru: ID сервиса поставщика

# Languages::addons.my_payment.secret_key
source: my_payment Secret Key
ru_ru: Секретный ключ

# Languages::addons.my_payment.paid_status
source: my_payment Status of order after payment
ru_ru: Статус ордера после оплаты

# Languages::addons.my_payment.error_in_request
source: my_payment Error in request from click
ru_ru: Ошибка в запросе от CLICK

# Languages::addons.my_payment.error_sign_check
source: my_payment Sign check error
ru_ru: Ошибка проверки подписи

# Languages::addons.my_payment.error_user_not_exist
source: my_payment User does not exist
ru_ru: Пользователь или заказ не существует

# Languages::addons.my_payment.error_already_paid
source: my_payment Already paid
ru_ru: Уже оплачено

# Languages::addons.my_payment.error_amount
source: my_payment Order total incorrect
ru_ru: Сумма не совподает

# Languages::addons.my_payment.success
source: my_payment Success
ru_ru: Успешно

# Languages::addons.my_payment.error_update_failed
source: my_payment Failed to update user
ru_ru: Ошибка при обновлении пользователя или заказа

# Languages::addons.my_payment.error_transaction_not_exist
source: my_payment Transaction does not exist
ru_ru: Транзакция не существует

# Languages::addons.my_payment.error_transaction_cancelled
source: my_payment Transaction cancelled
ru_ru: Транзакция отменена

# Languages::addons.my_payment.click_trans_id
source: my_payment Transaction ID
ru_ru: ИД Транзакции

# Languages::addons.my_payment.click_paydoc_id
source: my_payment Payment number
ru_ru: Номер платежа

# Languages::addons.my_payment.payment_receiving_time
source: my_payment Payment receiving time
ru_ru: Время платежа
